SET IDENTITY_INSERT [Rules].[MeasurementUnitConverter] ON;
GO

INSERT INTO [Rules].[MeasurementUnitConverter] 
  ([Id], [Description], [PhysicalParameterId], [MeasurementUnit1Id], [MeasurementUnit2Id], [Expression])
VALUES 
  (1, 'Преобразование для "Давление" (Па -> атм)', 1, 1, 2, N'x / 101325'),
  (2, 'Преобразование для "Давление" (атм -> Па)', 1, 2, 1, N'x * 101325'),
  (3, 'Преобразование для "Энергия" (кал -> Дж)', 3, 6, 7, N'x / 0.2388458'),
  (4, 'Преобразование для "Энергия" (Дж -> кал)', 3, 7, 6, N'x * 0.2388458'),
  (6, 'Преобразование для "Промежуток времени" (ч -> с)', 15, 33, 21, N'x / 3600'),
  (7, 'Преобразование для "Промежуток времени" (с -> ч)', 15, 21, 33, N'x * 3600'),
  (9, 'Преобразование для "Промежуток времени" (ч -> мин)', 15, 34, 21, N'x / 60'),
  (10, 'Преобразование для "Промежуток времени" (мин -> ч)', 15, 21, 34, N'x * 60'),
  (14, 'Преобразование для "Давление" (атм -> кгс/см2)', 1, 2, 37, N'x * 1'),
  (15, 'Преобразование для "Давление" (кгс/см2 -> атм)', 1, 37, 2, N'x / 1'),
  (16, 'Преобразование для "Масса" (кг -> т)', 6, 10, 18, N'x / 1000'),
  (17, 'Преобразование для "Масса" (т -> кг)', 6, 18, 10, N'x * 1000'),

  (18, N'Преобразование для "Тепловая мощность" (кал/ч -> Дж/ч)', 18, 27, 29, N'x / 0.2388458'),
  (19, N'Преобразование для "Тепловая мощность" (Дж/ч -> кал/ч)', 18, 29, 27, N'x * 0.2388458'),

  (20, N'Преобразование для "Энтальпия" (кал/т -> Дж/т)', 20, 47, 46, N'x / 0.2388458'),
  (21, N'Преобразование для "Энтальпия" (Дж/т -> кал/т)', 20, 46, 47, N'x * 0.2388458'),
  (24, N'Преобразование для "Объем" (литр -> м3)', 14, 36, 11, N'x * 0.001'),
  (25, N'Преобразование для "Массовый расход" (кг/сек -> т/ч)', 17, 32, 26, N'x / 0.277777'),
  (26, N'Преобразование для "Массовый расход" (т/ч -> кг/сек)', 17, 26, 32, N'x * 0.277777'),
  (27, N'Преобразование для "Температура" (К -> °С)', 2, 4, 5, N'x - 273.15'),
  (28, N'Преобразование для "Энергия" (кал -> Втч)', 3, 6, 51, N'x * 0.001163'),
  (29, N'Преобразование для "Энергия" (Втч -> кал)', 3, 51, 6, N'x * 860'),
  (30, 'Преобразование для "Давление" (Па -> кгс/см2)', 1, 1, 37, N'x * 0.00001019716213'),
  (31, 'Преобразование для "Объемный расход" (м3/мин -> м3/ч)', 7, 60, 17, N'x * 60'),
  (32, 'Преобразование для "Массовый расход" (т/мин -> т/ч)', 17, 61, 26, N'x * 60'),
  (33, 'Преобразование для "Тепловая мощность" (Гкал/мин -> Гкал/ч)', 18, 62, 27, N'x * 60')


GO

SET IDENTITY_INSERT [Rules].[MeasurementUnitConverter] OFF;
GO