SET IDENTITY_INSERT Business.ChannelTemplate ON;
GO

INSERT Business.ChannelTemplate(Id, Description, ResourceSystemTypeId, DeviceId, MnemoschemeId, Comment, CreatedBy, UpdatedBy, CreatedDate, UpdatedDate) 
  VALUES
-- МОНИТОРИНГ
		 (16, N'ECL310 - "Система мониторинга" (A266.1 - ЦО)', 8, 8, 16, N'A266.1 - ЦО', N'sa.maxim', N'sa.maxim', '20150410', '20150410'),
		 (18, N'ECL310 - "Система мониторинга" (A266.1 - ЦО+ГВС)', 8, 8, 16, N'A266.1 - ЦО+ГВС', N'sys', N'sys', '20150420', '20150420'),
		 (19, N'ECL310 - "Система мониторинга" (A230.1 - ЦО)', 8, 8, 1, N'A230.1 - ЦО', N'sys', N'sys', '20150420', '20150420'),
		 (22, N'ECL310 - "Система мониторинга" (A266.1 - ГВС)', 8, 8, 16, N'A266.1 - ГВС', N'sys', N'sys', '20150420', '20150420'),
		 (40, N'ECL300 - "Система мониторинга" (C66 - ЦО+ГВС)', 8, 34, 50, N'C66 - ЦО+ГВС', N'sys', N'sys', '20160928', '20160928'),
		 (41, N'ECL310 - "Система мониторинга" (A231.1 - ЦО)', 8, 8, 8, N'A231.1 - ЦО', N'sys', N'sys', '20170210', '20170210'),
		 (42, N'ECL310 - "Система мониторинга" (A368.1 - ЦО)', 8, 8, 8, N'A368.1 - ЦО', N'sys', N'sys', '20171109', '20171109'),
		 (60, N'ECL310 - "Система мониторинга" (A368.1 - ЦО+ГВС)', 8, 8, 24, N'A368.1 - ЦО+ГВС', N'sys', N'sys', '20171213', '20171213'),
		 (62, N'ECL310 - "Система мониторинга" (A368.3 - ЦО+ГВС)', 8, 8, 26, N'A368.3 - ЦО+ГВС', N'sys', N'sys', '20171214', '20171214'),
		 (216, N'ECL310 - "Система мониторинга" (A260.1 - ЦО+ЦО)', 8, 8, 72, N'A260.1 - ЦО+ЦО', N'sys', N'sys', '20190328', '20190328'),

		 (141, N'Siemens - "Система мониторинга" (котельная "Царево")', 8, 61, NULL, N'котельная "Царево"', N'sys', N'sys', '20180508', '20180508'),
         (143, N'Modicon221 - "Система мониторинга" (котельная ЖК "Весна", насосы)', 8, 66, NULL, N'котельная ЖК "Весна", насосы"', N'sys', N'sys', '20180904', '20180904'),
         (144, N'Modicon221 - "Система мониторинга" (котельная ЖК "Весна", котлы)', 8, 66, NULL, N'котельная ЖК "Весна", котлы"', N'sys', N'sys', '20180904', '20180904'),
         (148, N'ECL310 - "Система мониторинга" (A368.6 - ЦО+ГВС)', 8, 8, 64, N'A368.6 - ЦО+ГВС', N'sys', N'sys', '20181005', '20181005'),
         (163, N'VegaTP11 - "Система мониторинга" (мониторинг давления)', 8, 72, NULL, N'мониторинг давления', N'sys', N'sys', '20180915', '20180915'),
         (164, N'VegaTP11 - "Система мониторинга" (текущие параметры прибора)', 8, 72, NULL, N'текущие параметры прибора', N'sys', N'sys', '20180915', '20180915'),
         (165, N'VegaTP11 - "Система мониторинга" (датчик давления №1)', 8, 72, NULL, N'датчик давления №1', N'sys', N'sys', '20180918', '20180918'),
         (166, N'VegaTP11 - "Система мониторинга" (датчик давления №2)', 8, 72, NULL, N'датчик давления №2', N'sys', N'sys', '20180918', '20180918'),
         (167, N'VegaTP11 - "Система мониторинга" (датчик давления №3)', 8, 72, NULL, N'датчик давления №3', N'sys', N'sys', '20180918', '20180918'),
         (168, N'VegaTP11 - "Система мониторинга" (датчик давления №4)', 8, 72, NULL, N'датчик давления №4', N'sys', N'sys', '20180918', '20180918'),
         (169, N'VegaTP11 - "Система мониторинга" (датчик давления №5)', 8, 72, NULL, N'датчик давления №5', N'sys', N'sys', '20180918', '20180918'),
         (170, N'VegaTP11 - "Система мониторинга" (датчик давления №6)', 8, 72, NULL, N'датчик давления №6', N'sys', N'sys', '20180918', '20180918'),
         (171, N'Siemens - "Система мониторинга" (котельная "Царево", давление подпитки)', 8, 61, NULL, N'котельная "Царево", давление подпитки', N'sys', N'sys', '20180922', '20180922'),
         (176, N'Siemens - "Система мониторинга" (котельная ЖК ART City, ЩУН-1)', 8, 61, NULL, N'котельная ЖК ART City, ЩУН-1', N'sys', N'sys', '20181107', '20181107'),
         (179, N'DanfossMCX - "Система мониторинга" (тем-ра наруж., в помещении, подачи и обратки)', 8, 74, 66, N'тем-ра наруж., в помещении, подачи и обратки', N'sys', N'sys', '20181115', '20181115'),
		 (181, N'ECL300 - "Система мониторинга" (C66(RS485) - ЦО)', 8, 34, 66, N'C66(RS485) - ЦО', N'sys', N'sys', '20181130', '20181130'),
		 (183, N'ECL310 - "Система мониторинга" (A217.3 - ГВС)', 8, 8, 67, N'A217.3 - ГВС', N'sys', N'sys', '20181204', '20181204'),
		 (185, N'Siemens - "Система мониторинга" (Горелка котла №1 ЖК ART City)', 8, 61, NULL, N'Горелка котла №1 ЖК ART City', N'sys', N'sys', '20181209', '20181209'),
		 (186, N'Siemens - "Система мониторинга" (Горелка котла №2 ЖК ART City)', 8, 61, NULL, N'Горелка котла №2 ЖК ART City', N'sys', N'sys', '20181209', '20181209'),
		 (187, N'Siemens - "Система мониторинга" (Горелка котла №3 ЖК ART City)', 8, 61, NULL, N'Горелка котла №3 ЖК ART City', N'sys', N'sys', '20181209', '20181209'),
		 (188, N'DanfossPCM_MM - "Система мониторинга" (состояние дискретных входов)', 8, 75, NULL, N'состояние дискретных входов', N'sys', N'sys', '20181210', '20181210'),
		 (189, N'DanfossPCM_MM - "Система мониторинга" (Горелка котла №4 ЖК ART City)', 8, 75, NULL, N'Горелка котла №4 ЖК ART City', N'sys', N'sys', '20181210', '20181210'),
		 (199, N'Siemens - "Система мониторинга" (котельная Мирас, температуры)', 8, 61, NULL, N'котельная Мирас, температуры', N'sys', N'sys', '20190129', '20190129'),

		 (200, N'EtaRelay - "Система мониторинга"', 8, 60, NULL, NULL, N'sys', N'sys', '20180313', '20180313'),
		 (207, N'Siemens - "Система мониторинга" (котельная Мирас, дискреты)', 8, 61, NULL, N'котельная Мирас, дискреты', N'sys', N'sys', '20190129', '20190129'),
		 (208, N'ECL110 - "Система мониторинга" (приложение 130, ЦО)', 8, 78, NULL, N'приложение 130, ЦО', N'sys', N'sys', '20190311', '20190311'),
		 (210, N'ECL110 - "Система мониторинга" (приложение 116, ГВС)', 8, 78, NULL, N'приложение 116, ГВС', N'sys', N'sys', '20190313', '20190313'),
		 (213, N'Pramer710 - "Система мониторинга"', 8, 79, NULL, NULL, N'sys', N'sys', '20190324', '20190324'),

		 (221, N'VegaSmartMC0101 - "Система мониторинга" (контроль двери, датчик №1)', 8, 80, NULL, N'контроль двери, датчик №1', N'sys', N'sys', '20190612', '20190612'),
		 (222, N'VegaSmartMC0101 - "Система мониторинга" (контроль двери, датчик №2)', 8, 80, NULL, N'контроль двери, датчик №2', N'sys', N'sys', '20190612', '20190612'),
		 (223, N'VegaSmartMC0101 - "Система мониторинга" (контроль двери, датчик №3)', 8, 80, NULL, N'контроль двери, датчик №3', N'sys', N'sys', '20190612', '20190612'),
		 (224, N'VegaSmartMC0101 - "Система мониторинга" (контроль двери, датчик №4)', 8, 80, NULL, N'контроль двери, датчик №4', N'sys', N'sys', '20190612', '20190612'),
		 (225, N'VegaSmartMC0101 - "Система мониторинга" (контроль двери, датчик №5)', 8, 80, NULL, N'контроль двери, датчик №5', N'sys', N'sys', '20190612', '20190612'),
		 (226, N'VegaSmartMC0101 - "Система мониторинга" (контроль двери, датчик №6)', 8, 80, NULL, N'контроль двери, датчик №6', N'sys', N'sys', '20190612', '20190612'),
		 (227, N'VegaCI11 - "Система мониторинга" (датчик затопления №1)', 8, 81, NULL, N'датчик затопления №1', N'sys', N'sys', '20190612', '20190612'),
		 (228, N'VegaCI11 - "Система мониторинга" (датчик затопления №2)', 8, 81, NULL, N'датчик затопления №2', N'sys', N'sys', '20190612', '20190612'),
		 (229, N'VegaCI11 - "Система мониторинга" (датчик затопления №3)', 8, 81, NULL, N'датчик затопления №3', N'sys', N'sys', '20190612', '20190612'),
	     (230, N'VegaCI11 - "Система мониторинга" (датчик затопления №6)', 8, 81, NULL, N'датчик затопления №6', N'sys', N'sys', '20190612', '20190612'),
		 
		 (235, N'VegaTP11 - "Система мониторинга" (расцепитель эл-ва, квартира 485)', 8, 72, NULL, N'расцепитель эл-ва, квартира 485', N'sys', N'sys', '20190710', '20190710'),
         (239, N'VegaTP11 - "Система мониторинга" (затопление колодца №1)', 8, 72, NULL, N'затопление колодца №1', N'sys', N'sys', '20190725', '20190725'),
		 (256, N'ECL310 - "Система мониторинга" (A266.10 - ЦО+ГВС)', 8, 8, 16, N'A266.10 - ЦО+ГВС', N'sys', N'sys', '20191210', '20191210'),

		 (499, N'EtaDiscrete - "Система мониторинга" (дверь подвала - вход 1;дверь чердака - вход 2)', 8, 82, NULL, N'дверь подвала - вход 1;дверь чердака - вход 2', N'sys', N'sys', '20190618', '20190618'),
		 -- шаблоны I-7000 для мониторинга режима работы котлов
		 (2007, N'I7000 - "Система мониторинга" (котельная Ершова-49, модуль I)', 8, 28, NULL, N'котельная Ершова-49, модуль I', N'sys', N'sys', '20160901', '20160901'),
		 (2008, N'I7000 - "Система мониторинга" (котельная Ершова-49, модуль II)', 8, 28, NULL, N'котельная Ершова-49, модуль II', N'sys', N'sys', '20160901', '20160901'),


		 (3000, N'SigneticsSMH2Gi - "Система мониторинга" (карта ЦО+ГВС)', 8, 41, NULL, N'карта ЦО+ГВС', N'sys', N'sys', '20170323', '20170323'),
		 (3001, N'SigneticsSMH2Gi - "Система мониторинга" (карта ГВС)', 8, 41, NULL, N'карта ГВС', N'sys', N'sys', '20170323', '20170323'),
		 (3002, N'SigneticsSMH2Gi - "Система мониторинга" (карта ЦО)', 8, 41, NULL, N'карта ЦО', N'sys', N'sys', '20170323', '20170323'),

		 (3003, N'I7000 - "Система мониторинга" (УК "ЭЛЕКТРОТЕХНИКОВ")', 8, 28, NULL, N'УК "ЭЛЕКТРОТЕХНИКОВ"', N'sys', N'sys', '20170414', '20170414'),
		 (3004, N'I7000 - "Система мониторинга" (УК "ЭЛЕКТРОТЕХНИКОВ" - затопление + насосы)', 8, 28, NULL, N'УК "ЭЛЕКТРОТЕХНИКОВ" - затопление + насосы', N'sys', N'sys', '20170419', '20170419'),

		 (3005, N'Mitsubishi_FX5U - "Система мониторинга" (ЦТП, г. Тверь, ул. Хрустальная, д. 46)', 8, 50, NULL, N'ЦТП, г. Тверь, ул. Хрустальная, д. 46', N'sys', N'sys', '20170825', '20170825'),
		 (3006, N'I7000 - "Система мониторинга" (УК "МАХАЛЛЯ")', 8, 28, NULL, N'УК МАХАЛЛЯ', N'sys', N'sys', '20170831', '20170831'),

	     (25000, N'VegaSmartMC0101 - "Система мониторинга" (контроль двери чердака, датчик №1)', 8, 80, NULL, N'контроль двери чердака, датчик №1', N'sys', N'sys', '20190708', '20190708'),
		 (26000, N'VegaCI11 - "Система мониторинга" (датчик затопления колодца №1)', 8, 81, NULL, N'датчик затопления колодца №1', N'sys', N'sys', '20190709', '20190709')

GO

SET IDENTITY_INSERT Business.ChannelTemplate OFF;
GO