
INSERT INTO [Core].[MetaObjectLinkDevice] ([MetaObjectId], [DeviceId])
VALUES

(42, 1),
(42, 9),
(42, 13),
(42, 10),
(42, 12),
(42, 22), -- Взлет-24М
(85, 20), -- Взлет-026 (Отчет "Журналы Взлет-26")
(86, 20), -- Взлет-026 (Запрос "Журналы Взлет-26")
(42, 21), -- Взлет-026М
(85, 21), -- Взлет-026М (Отчет "Журналы Взлет-26")
(86, 21), -- Взлет-026М (Запрос "Журналы Взлет-26")
(42, 27), -- ТВ-7
(76, 27), -- ТВ-7 (Отчет "Асинхронные архивы")
(77, 27), -- ТВ-7 (Запрос "Асинхронные архивы")
(106, 27), -- ТВ-7 (Настройки прибора)
(42, 29), -- CE-301
(42, 16), -- CE-303
(42, 11), -- Взлет-022_023
(42, 3), -- Меркурий-230 
(99, 3), -- Меркурий-230 (График потребления активной и реактивной мощности в рабочий день)
(42, 30), -- ИВК-102
(42, 36), -- ЦЭ2726А
(42, 38),  -- СПТ943
(42, 37), -- СПТ941.10(11)
(42, 39), -- СПТ941
(42, 14), -- Пульсар-2
(42, 40), -- Магика
(42, 42), -- ИРВИС (счетчик газа)
(42, 35), -- EK270 (корректор газа)
(42, 44), -- ЭХО-Р-02 (ультразвуковой счетчик)
(42, 45), -- СПТ 941.20
(42, 46), -- ЭЛЬФ
(42, 47), -- СЭТ-4ТМ.03М
(99, 47), -- СЭТ-4ТМ.03М (График потребления активной и реактивной мощности в рабочий день)
(42, 48), -- ТЭСМА-106
(42, 49), -- CoalEquivalentVirtualDevice
(42, 54), -- ТЭМ-104
(42, 55), -- ТЭМ-106
(42, 56), -- Меркурий-234 
(99, 56), -- Меркурий-234 (График потребления активной и реактивной мощности в рабочий день)
(42, 57), -- ТЭМ-104 (ТЭСМАРТ)
(42, 58), -- ВКТ-9
(42, 59), -- Пульсар-16М
(42, 62), -- Пульсар-2М
(42, 63), -- Взлет-43
(42, 64), -- Взлет-25
(42, 71), -- ТЭМ-116
(102, 46), -- Эльф (Нештатные ситуации ведомостей учета ресурсов)
(102, 64), -- Взлет-25 (Нештатные ситуации ведомостей учета ресурсов)
(103, 64), -- Взлет-25 (Настройки прибора)
(42, 76), -- ПСЧ-4ТМ.05МК
(42, 77), -- ЭСКО ТМ-3Э (Ведомость учета параметров)
(103, 77), -- ЭСКО ТМ-3Э (Настройки прибора)
(104, 79), -- Прамер-710
(103, 21), -- Взлет-26М (Настройки прибора)
(103, 10), -- Взлет-33 (Настройки прибора)
(42, 86), -- ВИС.Т
(103, 86), -- ВИС.Т (Настройки прибора)
(42, 87) -- АКРОН (типа ЭХО)


GO
