SET IDENTITY_INSERT Business.ChannelTemplate ON;
GO

INSERT Business.ChannelTemplate(Id, Description, ResourceSystemTypeId, ResourceSubsystemTypeId, DeviceId, MnemoschemeId, Comment, CreatedBy, UpdatedBy, CreatedDate, UpdatedDate) 
  VALUES 
         (92, N'Pulsar16M - "Система газоснабжения" (канал 2)', 1, NULL, 59, NULL, N'канал 2', N'sys', N'sys', '20180227', '20180227'),
		 (93, N'Pulsar16M - "Система газоснабжения" (канал 1)', 1, NULL, 59, NULL, N'канал 1', N'sys', N'sys', '20180228', '20180228'),
		 (96, N'Irvis - "Система газоснабжения (заводской отчет)"', 1, NULL, 42, NULL, N'заводской отчет', N'sys', N'sys', '20180419', '20180419'),

		 (138, N'Pulsar16M - "Система газоснабжения" (канал 1, котел №1)', 1, NULL, 59, NULL, N'канал 1, котел №1', N'sys', N'sys', '20180330', '20180330'),
		 (139, N'Pulsar16M - "Система газоснабжения" (канал 2, котел №2)', 1, NULL, 59, NULL, N'канал 2, котел №2', N'sys', N'sys', '20180330', '20180330'),
		 
		 (140, N'EK270 - "Система газоснабжения" (протокол Modbus)', 1, NULL, 35, NULL, N'протокол Modbus', N'sys', N'sys', '20180405', '20180405'),

		 (197, N'Pulsar16M - "Система газоснабжения" (канал 3, котел №3)', 1, NULL, 59, NULL, N'канал 3, котел №3', N'sys', N'sys', '20190114', '20190114'),
		 (198, N'Pulsar16M - "Система газоснабжения" (канал 4, котел №4)', 1, NULL, 59, NULL, N'канал 4, котел №4', N'sys', N'sys', '20190114', '20190114'),

		 (244, N'VKT7 - "Система газоснабжения" (котел №1, ТВ2 тр2)', 1, NULL, 1, NULL, N'котел №1, ТВ2 тр2', N'sys', N'sys', '20190903', '20190903'),
		 (245, N'VKT7 - "Система газоснабжения" (котел №2, ТВ2 тр1)', 1, NULL, 1, NULL, N'котел №2, ТВ2 тр1', N'sys', N'sys', '20190903', '20190903'),
		 (246, N'VKT7 - "Система газоснабжения" (котел №3, ТВ1 тр1)', 1, NULL, 1, NULL, N'котел №3, ТВ1 тр1', N'sys', N'sys', '20190903', '20190903'),
	     (247, N'VKT7 - "Система газоснабжения" (котел №4, ТВ1 тр2)', 1, NULL, 1, NULL, N'котел №4, ТВ1 тр2', N'sys', N'sys', '20190903', '20190903'),

         (5000, N'Irvis - "Система газоснабжения"', 1, NULL, 42, NULL, NULL, N'sys', N'sys', '20170426', '20170426'),
		 (5001, N'EK270 - "Система газоснабжения"', 1, NULL, 35, NULL, NULL, N'sys', N'sys', '20170512', '20170512'),
		 (5003, N'EK270 - "Система газоснабжения (отчет в стиле СОДЭК)"', 1, NULL, 35, NULL, N'отчет в стиле СОДЭК', N'sys', N'sys', '20171116', '20171116'),
		 (5004, N'EK270 - "Система газоснабжения (отчет в стиле СОДЭК, котельная, ЦО)"', 1, NULL, 35, NULL, N'отчет в стиле СОДЭК, котельная, ЦО', N'sys', N'sys', '20191230', '20191230'),
		 (5005, N'EK270 - "Система газоснабжения (отчет в стиле СОДЭК, котельная, ГВС)"', 1, NULL, 35, NULL, N'отчет в стиле СОДЭК, котельная, ГВС', N'sys', N'sys', '20191230', '20191230')


GO

SET IDENTITY_INSERT Business.ChannelTemplate OFF;